import random

1. пайтон - интерпретируемый язык
2. плюсы-можно создать разные типы данных в одном списке, не нужно писать отдельно функцию для строк и
  чисел. минусы- может выдавать ошибки при одной и той же функции, считывает информацию по строкам -это
  увеличивает время.
3.меняющиеся - списки, картежи, словари, функции. постоянные - строковые и числовые.
4.списочные типы - множество, словари, лист комприхеншен.
5.упорядоченные - списки, картежи.
6.эта функция определяет тип данных.
7.list - создаёт список, int - создаёт целое число, dict - создаёт словарь, print - выводит на экран,
 None - означает пустоту или ложь, input - вводит данные, break - прекращает цикл, len - определяет длину
 строки, set - создаёт множество, while - создаёт условие для цикла.
8..append - дбавляет в конец списка, insert - вставляет в список, idex - выбирает объект из списка по индексу,
  рор - удаляет ненужные данные, remove - удаляет самый первый элемент из списка.
9.keys - просмотр ключей в словаре, items - перевернуть пары ключ-значение, values - вернуть значения,
  clear - очищает словарь, copy - копирует словарь.
10.словарь - это набор пар ключ-значение, а множество - это просто набор значений.
11.pep 8 - это правила написания кода, а дзен - это филисофия программирования.
12.venv - это глобальное виртуальное окружение, при работе в котором какие либо изменения затрагивают всех,
  а pipnv - это локальное виртуальное окружение и изменения происходят только на локальном сервере.
13.пип используют для оптимизации написания кода.
14.эта команда для создания новой папки.
15. is - по ссылкам, == - по значению.
16. git init, git add, git commit, git branch, git remote add origin, git pull, git push.
17.инициализация репозитория.
18.с помощью функции str.
19.картежи неизменяемы, списки - изменяемый тип данных, т.е в списки можно заменять элементы,
 а в картеже - нет.
20.false == 0, true == 1.
21.// - целочисленное деление, % - остаток от деления.
22.break - полностью заканчивает цикл, continue - оставляет возможность для продолжения цикла.,
23.ветвление используется, если в написании кода есть условия. = - присвание, == - равенство какому либо
  значению.
24.random - для выбора случайного значения.random.random - генерирует случайные значения,
  random.randint - устанавливает диапазон значений для выбора, random.rangerange - ращает случайное значение.
  используется, например, для угадывания числа - лотерея.
25.это оптимизированый список данных. пример list(i * i**3 for i in range(0,27))
    list(i for i in range(0,27,2))